/*****************************************************************************************************
// Методы класса. Что такое методы в программировании. Вызов метода класса. Функции.| Уроки C++ #74  
//----------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2019 
//----------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2022 @ sgiman
/*****************************************************************************************************

#include <iostream>
#include <string>
#include "utils.h"

#define _CRT_SECURE_NO_WARNINGS

using namespace std;

/*
 *	Библитека
 */

/*********************************
           === MAIN ===           
**********************************/
nt main(int argc, char* argv[])
{
	setlocale(LC_ALL, "ru");



	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}
