//****************************************************
// Типы данных | C++ для начинающих | Урок #4
//----------------------------------------------------
// С++ | Visual Studio 2019 
//----------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2022 @ sgiman
//****************************************************

#include <iostream>

using namespace std;

int main()
{
   /*
	* Числовые
	* Символьные
	* Логические 
	*------------------------
	* float - 4 bytes (одинарная точность)
	* double - 8 bytes (двойная точность)
	* int - 4 bytes 
	* short - 2 bytes
	* long - 4 bytes (давно не используется)
	* char - 1 byte (символьный)
	* bool - 1 byte (логический)
	*/
	setlocale(LC_ALL, "ru");


	/* ... */
	cout << " \n Привет!";


	//=== END ===
	cout << endl;
	cin.get();
	return 0;
}
