//**********************************************************************************
// Инкремент и декремент. Постфиксный и префиксный. | C++ для начинающих | Урок #9
//----------------------------------------------------------------------------------
// С++ | Visual Studio 2019 
//----------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2022 @ sgiman
//**********************************************************************************

#include <iostream>

using namespace std;

// инкремент и декремент 

int main()
{
	setlocale(LC_ALL, "Rus");
	
	int a = 1, b = 1;

	// ПОСТФИКСНАЯ ФОРМА: a++, a--
	cout << a << endl;
	cout << " postfix: " << endl;
	cout << a++ << endl << endl;

	// ПРЕФИКСНАЯ ФОРМА: ++b, --b 
	cout << b << endl;
	cout << " prefix: " << endl;
	cout << ++b << endl;

	a = 1;
	b = 0;
	b = ++a * a;
	cout << b << endl;


	//=== END ===
	cout << endl;
	cin.get();
	return 0;
}
