//************************************************************************************
// Visual studio. Как создать проект. Первая программа. C++ для начинающих | Урок #2
//------------------------------------------------------------------------------------
// С++ | Visual Studio 2019 
//------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2022 @ sgiman
//************************************************************************************


#include <iostream>
#include <math.h>

using namespace std;

void main()
{
    setlocale(LC_ALL, "Rus");

    cout << "\n Привет МИР!"<< endl;

	//=== END ===
	cout << endl;
	cin.get();
	return 0;
}
